<style  type="text/css"> 
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111-002/V002 (Spring 2023)<br>Introduction to Databases
</span>
</center></b>
</span><br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Homework 4: All Tracks<br>
</span>
</center></i><br><br>

# Overview

- There are two parts to HW 4:
    - ```4a```: Written questions
    - ```4b:``` A common set of practical tasks for both the programming and non-programming tracks.
    
    
- HW 4 __does not__ have separate assignments for the programming and non-programming tracks. 


Homework 4b has the following tasks:


1. Create a new schema ```<uni>_S22_classic_models_star.``` Replace ```<uni>``` with your UNI.<br><br>
2. You will create a [star schema](https://en.wikipedia.org/wiki/Star_schema) using the data from your Classic Models database.
    - The fact in the fact table is of the form ```(productCode, quantityPrders, priceEach, orderedData, customerNumber).```
    - The dimensions are:
        - ```date_dimension: year, quarter, month, day of the month.```
        - ```location_dimension: region, country, city.``` The zip file contain a file ```country_region.csv``` that provides the mapping of countries to regions.
        - ```product_dimension: product_scale, product_line, product_vendor.```<br><br>
3. You will write queries that demonstrate:
    - A slice of the data.
    - A dice of the data.
    - A drill-down.
    - A roll-up.
    
    
- The homework is due on ```2022-MAY-01``` at 11:59 PM. We will post detailed submission instructions on Ed and Gradescope. Your submission format will be PDF and zip copies of this notebook. You must name your files following the instructions we publish.

# Setup

In [1]:
import pandas as pd

In [2]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:ll700529@localhost

'Connected: root@None'

In [4]:
country_region = pd.read_csv('./country_region.csv')

In [5]:
country_region

         Country Region
0         France   EMEA
1            USA    NaN
2      Australia   APAC
3         Norway   EMEA
4         Poland   EMEA
5        Germany   EMEA
6          Spain   EMEA
7         Sweden   EMEA
8        Denmark   EMEA
9      Singapore   APAC
10      Portugal   EMEA
11         Japan   APAC
12       Finland   EMEA
13            UK   EMEA
14       Ireland   EMEA
15        Canada    NaN
16     Hong Kong   APAC
17         Italy   EMEA
18   Switzerland   EMEA
19   Netherlands   EMEA
20       Belgium   EMEA
21   New Zealand   APAC
22  South Africa   EMEA
23       Austria   APAC
24   Philippines   APAC
25        Russia   EMEA
26        Israel   EMEA

In [37]:
from sqlalchemy import create_engine

In [38]:
engine = \
    create_engine("mysql+pymysql://root:ll700529@localhost")

In [39]:
country_region.to_sql('country_region',
                     schema = 'll3461_S22_classic_models_star',
                     con = engine,
                     index = False,
                     if_exists = 'replace')

# Schema

- Execute your SQL statements for creating the schema, table and constraints for the fact and dimension tables in the following cells.

In [35]:
%%sql 
DROP SCHEMA ll3461_S22_classic_models_star;
CREATE SCHEMA ll3461_S22_classic_models_star;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [40]:
%%sql
USE ll3461_S22_classic_models_star;
UPDATE country_region 
SET region = 'NA' 
WHERE region is NULL

 * mysql+pymysql://root:***@localhost
0 rows affected.
2 rows affected.

[]

# Data Loading

- Enter and execute your SQL for loading the data into the facts and dimensions table. The source of the information is the Classic Models data.

In [41]:
%%sql
DROP TABLE sales_facts;
CREATE TABLE sales_facts (
    SELECT 
        productCode,
        quantityOrdered, 
        priceEach, 
        orderDate,
        customerNumber 
    FROM classicmodels.orders 
    
    JOIN 
        classicmodels.orderdetails using(orderNumber)
)

 * mysql+pymysql://root:***@localhost
2996 rows affected.

[]

In [45]:
%%sql 
DROP TABLE date_dimension;
CREATE TABLE date_dimension 
AS
SELECT 
    DISTINCT orderDate,
    year(orderDate) AS year, 
    quarter(orderDate) AS quarter,
    month(orderDate) AS month, 
    day(orderDate) AS day
FROM classicmodels.orders

 * mysql+pymysql://root:***@localhost
0 rows affected.
265 rows affected.

[]

In [46]:
%%sql 
DROP TABLE location_dimension;
CREATE TABLE location_dimension 
AS
SELECT 
    customerNumber,
    region, 
    country, 
    city 
FROM classicmodels.customers

LEFT JOIN 
    country_region using(country)

 * mysql+pymysql://root:***@localhost
0 rows affected.
122 rows affected.

[]

In [47]:
%%sql 
UPDATE location_dimension
SET region = "EMEA"
WHERE country = "Norway";

 * mysql+pymysql://root:***@localhost
3 rows affected.

[]

In [48]:
%%sql
DROP TABLE if exists product_dimension;
CREATE TABLE product_dimension 
AS
SELECT 
    productCode, 
    productScale, 
    productLine, 
    productVendor 
FROM classicmodels.products

 * mysql+pymysql://root:***@localhost
0 rows affected.
110 rows affected.

[]

In [49]:
%%sql 
ALTER TABLE date_dimension
ADD PRIMARY KEY (orderDate)

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [50]:
%%sql 
ALTER TABLE location_dimension
ADD PRIMARY KEY (customerNumber)

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [51]:
%%sql 
ALTER TABLE product_dimension
ADD PRIMARY KEY (productCode)

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [52]:
%%sql 
ALTER TABLE sales_facts
ADD FOREIGN KEY (orderDate) 
REFERENCES date_dimension(orderDate)

 * mysql+pymysql://root:***@localhost
2996 rows affected.

[]

In [53]:
%%sql 
ALTER TABLE sales_facts
ADD FOREIGN KEY (customerNumber) 
REFERENCES location_dimension(customerNumber)

 * mysql+pymysql://root:***@localhost
2996 rows affected.

[]

In [54]:
%%sql 
ALTER TABLE sales_facts
ADD FOREIGN KEY (productCode) 
REFERENCES product_dimension(productCode)

 * mysql+pymysql://root:***@localhost
2996 rows affected.

[]

# Queries

- In each of the sections below, define what your query is producing, provide the query and execute to produce the results.

In [64]:
%%sql
DROP VIEW if exists cube_view;
CREATE VIEW cube_view AS
SELECT
    sales_facts.*,
    year,
    quarter,
    month,
    day,
    region,
    a.country,
    city,
    productScale,
    productLine,
    productVendor
FROM sales_facts

LEFT JOIN 
    date_dimension USING (orderDate)
    
LEFT JOIN 
    location_dimension AS a USING (customerNumber)
    
LEFT JOIN 
    product_dimension USING (productCode);

 * mysql+pymysql://root:***@localhost
0 rows affected.
0 rows affected.

[]

## Roll Up

Explanation:Roll-up performs aggregation of productvendor, year, region on a data cube.

In [65]:
%%sql
SELECT 
    productVendor, 
    year,
    region, 
    COUNT(*) AS no_of_sales
FROM cube_view
GROUP BY productVendor, year, region
limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('Welly Diecast Productions', 2003, 'NA', 31),
 ('Motor City Art Classics', 2003, 'NA', 29),
 ('Exoto Designs', 2003, 'NA', 35),
 ('Red Start Diecast', 2003, 'NA', 28),
 ('Autoart Studio Design', 2003, 'EMEA', 37),
 ('Gearbox Collectibles', 2003, 'EMEA', 36),
 ('Motor City Art Classics', 2003, 'EMEA', 38),
 ('Classic Metal Creations', 2003, 'EMEA', 39),
 ('Studio M Art Models', 2003, 'NA', 29),
 ('Second Gear Diecast', 2003, 'EMEA', 27)]

## Drilldown

Explanation: Drilling the cube down into two dimensionals. One dimension is date dimension which drill down from order year to order month.And other dimesion is location which drill down from region to country.

In [66]:
%%sql
SELECT
    productVendor,
    month, 
    country, 
    COUNT(*) AS no_of_sales
FROM cube_view
GROUP BY productVendor, month, country
limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('Welly Diecast Productions', 1, 'USA', 3),
 ('Motor City Art Classics', 1, 'USA', 9),
 ('Exoto Designs', 1, 'USA', 9),
 ('Red Start Diecast', 1, 'USA', 5),
 ('Autoart Studio Design', 1, 'Germany', 1),
 ('Gearbox Collectibles', 1, 'Germany', 1),
 ('Motor City Art Classics', 1, 'Germany', 1),
 ('Classic Metal Creations', 1, 'Germany', 1),
 ('Studio M Art Models', 1, 'USA', 6),
 ('Classic Metal Creations', 1, 'Norway', 1)]

## Slice

Explanation:Select productVendor, month from Germany, which means that it selects a specific country from data cube.

In [67]:
%%sql
SELECT 
    productVendor, 
    month, 
    country, 
    count(*) AS no_of_sales
FROM cube_view
GROUP BY productVendor, month, country
HAVING country = 'Germany'
limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('Autoart Studio Design', 1, 'Germany', 1),
 ('Gearbox Collectibles', 1, 'Germany', 1),
 ('Motor City Art Classics', 1, 'Germany', 1),
 ('Classic Metal Creations', 1, 'Germany', 1),
 ('Autoart Studio Design', 11, 'Germany', 1),
 ('Welly Diecast Productions', 11, 'Germany', 2),
 ('Studio M Art Models', 11, 'Germany', 2),
 ('Min Lin Diecast', 11, 'Germany', 1),
 ('Gearbox Collectibles', 11, 'Germany', 1),
 ('Classic Metal Creations', 11, 'Germany', 2)]

## Dice

Explanation:a sub-cube is selected by selecting with criteria: country = 'USA' or 'Germany' and month = '1' or '2' or '3'.

In [68]:
%%sql
SELECT
    productVendor, 
    month, 
    country, 
    count(*) AS no_of_sales
FROM cube_view
GROUP BY productVendor, month, country
HAVING country in ('Germany', 'USA') 
AND month BETWEEN 1 AND 3
limit 10;

 * mysql+pymysql://root:***@localhost
10 rows affected.

[('Welly Diecast Productions', 1, 'USA', 3),
 ('Motor City Art Classics', 1, 'USA', 9),
 ('Exoto Designs', 1, 'USA', 9),
 ('Red Start Diecast', 1, 'USA', 5),
 ('Autoart Studio Design', 1, 'Germany', 1),
 ('Gearbox Collectibles', 1, 'Germany', 1),
 ('Motor City Art Classics', 1, 'Germany', 1),
 ('Classic Metal Creations', 1, 'Germany', 1),
 ('Studio M Art Models', 1, 'USA', 6),
 ('Min Lin Diecast', 2, 'USA', 6)]